

三层交换实现虚拟局域网通信
==========================



一、通过端口IP实现不同网络间通信
--------------------------------

​		#搭建拓扑图

<img src="C:\Users\Administrator\AppData\Roaming\Typora\typora-user-images\image-20220402205315357.png" alt="image-20220402205315357" style="zoom:67%;" />



### 	1.配置电脑的默认网关

<img src="C:\Users\Administrator\AppData\Roaming\Typora\typora-user-images\image-20220402204408564.png" alt="image-20220402204408564" style="zoom:50%;" />

### 	

### 2.配置电脑的IP地址和子网掩码

<img src="C:\Users\Administrator\AppData\Roaming\Typora\typora-user-images\image-20220402204456081.png" alt="image-20220402204456081" style="zoom:50%;" />



### 	3.所有4台电脑，依次配置

| 电脑    | 默认网关          | IP地址          | 子网掩码          |
| ------- | ----------------- | --------------- | ----------------- |
| *PC0*   | *192.168.1.100*   | *192.168.1.1*   | *255.255.255.0*   |
| *PC1*   | *192.168.1.100*   | *192.168.1.2*   | *255.255.255.0*   |
| **PC2** | **192.168.2.100** | **192.168.2.1** | **255.255.255.0** |
| **PC3** | **192.168.2.100** | **192.168.2.2** | **255.255.255.0** |



### 	4.三层交换机3560配置

```
#进入全局配置模式  关闭1和2口的交换功能
Switch(config)# interface range fastEthernet 0/1-2
Switch(config-if-range)# no switchport
Switch(config-if-range)# exit


```

```
#进入1口，配置IP地址
Switch(config)# interface fastEthernet 0/1
Switch(config-if)# ip address 192.168.1.100 255.255.255.0
Switch(config-if)# exit
```

```
#进入2口，配置IP地址
Switch(config)# interface fastEthernet 0/2
Switch(config-if)# ip address 192.168.2.100 255.255.255.0
Switch(config-if)# exit
```

```
#开启三层交换机路由功能
Switch(config)# ip routing
```

​	#此时，不同网段间可互相通信。



二、通过VLAN IP实现不同VLAN通信
-------------------------------

​		#搭建拓扑图

<img src="E:\笔记\image-20220402211721279.png" alt="image-20220402211721279" style="zoom:67%;" />

### 	

### 1.所有4台电脑，依次配置

| 电脑    | 默认网关          | IP地址          | 子网掩码          |
| ------- | ----------------- | --------------- | ----------------- |
| *PC4*   | *192.168.3.100*   | *192.168.3.1*   | *255.255.255.0*   |
| *PC5*   | *192.168.3.100*   | *192.168.3.2*   | *255.255.255.0*   |
| **PC6** | **192.168.4.100** | **192.168.4.1** | **255.255.255.0** |
| **PC7** | **192.168.4.100** | **192.168.4.2** | **255.255.255.0** |

### 	2.三层交换机3560配置

```
#在特权模式下，进入VLAN 数据库模式
Switch# vlan database
Switch(vlan)# vlan 10 name CAIWU
Switch(vlan)# vlan 20 name RENSHI
Switch(vlan)# exit
```

```
#给两个VLAN 划分端口
Switch(config)# interface range fastEthernet 0/1-2
Switch(config-if-range)# switchport access vlan	10
Switch(config-if-range)# exit

Switch(config)# interface range fastEthernet 0/3-4
Switch(config-if-range)# switchport access vlan	20
Switch(config-if-range)# exit
```

```
#给两个VLAN分别配IP地址
Switch(config)# interface vlan 10
Switch(config-if)# ip address 192.168.3.100 255.255.255.0
Switch(config-if)# exit

Switch(config)# interface vlan 20
Switch(config-if)# ip address 192.168.4.100 255.255.255.0
Switch(config-if)# exit
```

```
#开启三层交换机路由功能
Switch(config)# ip routing
```











